app/Controllers/Siswa/Dashboard.php

SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '3'
---
    public function cekKonfirmasi()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(404);
        }

        $siswaId = session()->get('id');
        $inputTglLahir = $this->request->getPost('tanggal_lahir');
        $mapelId = $this->request->getPost('mapel_id');

        $siswa = $this->siswaModel->find($siswaId);

SELECT *
FROM `status_ujian_siswa`
WHERE `jadwal_id` = '2'
AND `siswa_id` = '3'
---
        }

        // Cek apakah siswa sudah selesai ujian ini sebelumnya
        $statusUjian = $this->db->table('status_ujian_siswa')
            ->where('jadwal_id', $jadwal['id'])
            ->where('siswa_id', $siswaId)
            ->get()->getRowArray();