app/Controllers/Siswa/Ujian.php

SELECT `jadwal_ujian`.*, `mapel`.`nama_mapel`, `sekolah`.`nama_sekolah`
FROM `jadwal_ujian`
JOIN `mapel` ON `mapel`.`id` = `jadwal_ujian`.`mapel_id`
JOIN `sekolah` ON `sekolah`.`id` = `jadwal_ujian`.`sekolah_id`
WHERE `jadwal_ujian`.`id` = '2'
---
    public function index()
    {
        $jadwalId = session()->get('jadwal_id_aktif');
        $siswaId = session()->get('id');

        if (!$jadwalId) {
            return redirect()->to('siswa/dashboard');
        }

        $jadwal = $this->jadwalModel
            ->select('jadwal_ujian.*, mapel.nama_mapel, sekolah.nama_sekolah')
            ->join('mapel', 'mapel.id = jadwal_ujian.mapel_id')
            ->join('sekolah', 'sekolah.id = jadwal_ujian.sekolah_id')
            ->find($jadwalId);

SELECT *
FROM `soal`
WHERE `guru_id` = '1'
AND `mapel_id` = '1'
ORDER BY `id` ASC
---
            ]);
        }

        $soal = $this->soalModel
            ->where('guru_id', $jadwal['guru_id'])
            ->where('mapel_id', $jadwal['mapel_id'])
            ->orderBy('id', 'ASC')
            ->findAll();