app/Controllers/Siswa/Ujian.php

    public function index()
    {
        $siswaId = session()->get('id');
        $siswa = $this->db->table('siswa')->where('id', $siswaId)->get()->getRow();

        $builder = $this->db->table('jadwal_ujian');
        $builder->select('jadwal_ujian.*, mapel.nama_mapel, guru.nama_lengkap as nama_guru');
        $builder->join('mapel', 'mapel.id = jadwal_ujian.mapel_id');
        $builder->join('guru', 'guru.id = jadwal_ujian.guru_id', 'left');
        $builder->where('jadwal_ujian.sekolah_id', $siswa->sekolah_id);
        $builder->where('jadwal_ujian.tanggal_ujian', date('Y-m-d'));
        $ujian = $builder->get()->getResultArray();

        foreach ($ujian as &$u) {
            $cekStatus = $this->db->table('status_ujian_siswa')
                ->where('jadwal_id', $u['id'])
                ->where('siswa_id', $siswaId)
                ->get()->getRow();
---
SELECT *
FROM `siswa`
WHERE `id` = '2'
SELECT *
FROM `status_ujian_siswa`
WHERE `jadwal_id` = '4'
AND `siswa_id` = '2'

    public function kerjakan($jadwalId)
    {
        $siswaId = session()->get('id');

        $jadwal = $this->db->table('jadwal_ujian')
            ->select('jadwal_ujian.*, mapel.nama_mapel')
            ->join('mapel', 'mapel.id = jadwal_ujian.mapel_id')
            ->where('jadwal_ujian.id', $jadwalId)
            ->get()->getRow();

        $statusSiswa = $this->db->table('status_ujian_siswa')
            ->where('jadwal_id', $jadwalId)
            ->where('siswa_id', $siswaId)
            ->get()->getRow();

        if (!$statusSiswa || $statusSiswa->status == 'selesai') {
            return redirect()->to(base_url('siswa/ujian'))->with('error', 'Sesi ujian tidak valid atau sudah selesai.');
---
SELECT *
FROM `siswa`
WHERE `id` = '3'

    public function simpan_jawaban()
    {
        if ($this->request->isAJAX()) {
            $siswaId = session()->get('id');
            $jadwalId = $this->request->getPost('jadwal_id');
            $soalId = $this->request->getPost('soal_id');
            $jawaban = $this->request->getPost('jawaban');

            if (is_array($jawaban)) {
                $jawaban = json_encode($jawaban);
            }

            $cek = $this->db->table('hasil_ujian')
                ->where('jadwal_id', $jadwalId)
                ->where('siswa_id', $siswaId)
                ->where('soal_id', $soalId)
                ->countAllResults();

            if ($cek > 0) {
                $this->db->table('hasil_ujian')
                    ->where('jadwal_id', $jadwalId)
                    ->where('siswa_id', $siswaId)
                    ->where('soal_id', $soalId)
                    ->update(['jawaban_siswa' => $jawaban, 'waktu_submit' => date('Y-m-d H:i:s')]);
            } else {
                $this->db->table('hasil_ujian')->insert([
                    'jadwal_id' => $jadwalId,
                    'siswa_id' => $siswaId,
                    'soal_id' => $soalId,
                    'jawaban_siswa' => $jawaban,
                    'waktu_submit' => date('Y-m-d H:i:s')
                ]);
---
SELECT COUNT(*) AS `numrows`
FROM `hasil_ujian`
WHERE `jadwal_id` = '1'
AND `siswa_id` = '1'
AND `soal_id` = '2'
INSERT INTO `hasil_ujian` (`jadwal_id`, `siswa_id`, `soal_id`, `jawaban_siswa`, `waktu_submit`) VALUES ('1', '1', '2', 'dfdfsaaa', '2026-02-12 01:49:49')

    public function selesai_ujian()
    {
        $siswaId = session()->get('id');
        $jadwalId = $this->request->getPost('jadwal_id');

        $this->hitungNilaiOtomatis($jadwalId, $siswaId);

        $this->db->table('status_ujian_siswa')
            ->where('jadwal_id', $jadwalId)
            ->where('siswa_id', $siswaId)
            ->update(['status' => 'selesai']);
---
UPDATE `status_ujian_siswa` SET `status` = 'selesai'
WHERE `jadwal_id` = '1'
AND `siswa_id` = '1'

    private function hitungNilaiOtomatis($jadwalId, $siswaId)
    {
        $jawabanSiswa = $this->db->table('hasil_ujian')
            ->select('hasil_ujian.jawaban_siswa, soal.jenis, soal.kunci_jawaban')
            ->join('soal', 'soal.id = hasil_ujian.soal_id')
            ->where('hasil_ujian.jadwal_id', $jadwalId)
            ->where('hasil_ujian.siswa_id', $siswaId)
            ->get()->getResultArray();
---
SELECT `hasil_ujian`.`jawaban_siswa`, `soal`.`jenis`, `soal`.`kunci_jawaban`
FROM `hasil_ujian`
JOIN `soal` ON `soal`.`id` = `hasil_ujian`.`soal_id`
WHERE `hasil_ujian`.`jadwal_id` = '1'
AND `hasil_ujian`.`siswa_id` = '1'

        $nilaiPgKompleks = ($total['pg_kompleks'] > 0) ? ($score['pg_kompleks'] / $total['pg_kompleks']) * 100 : 0;
        $nilaiBenarSalah = ($total['benar_salah'] > 0) ? ($score['benar_salah'] / $total['benar_salah']) * 100 : 0;

        $this->db->table('status_ujian_siswa')
            ->where('jadwal_id', $jadwalId)
            ->where('siswa_id', $siswaId)
            ->update([
                'nilai_pg' => $nilaiPg,
                'nilai_pg_kompleks' => $nilaiPgKompleks,
                'nilai_benar_salah' => $nilaiBenarSalah
            ]);
---
UPDATE `status_ujian_siswa` SET `nilai_pg` = 100, `nilai_pg_kompleks` = 0, `nilai_benar_salah` = 0
WHERE `jadwal_id` = '1'
AND `siswa_id` = '1'