app/Controllers/Admin/BankSoal.php

    public function index()
    {
        $data = [
            'title' => 'Bank Soal (Admin)',
            'pembuat_soal' => $this->guruModel->findAll()
---
SELECT *
FROM `guru`

    public function mapel($guruId)
    {
        $mapel = $this->db->table('guru_mapel')
            ->select('mapel.*')
            ->join('mapel', 'mapel.id = guru_mapel.mapel_id')
            ->where('guru_mapel.guru_id', $guruId)
            ->get()->getResultArray();

        $guru = $this->guruModel->find($guruId);
---
SELECT `mapel`.*
FROM `guru_mapel`
JOIN `mapel` ON `mapel`.`id` = `guru_mapel`.`mapel_id`
WHERE `guru_mapel`.`guru_id` = '1'
SELECT *
FROM `guru`
WHERE `guru`.`id` = '1'

    public function list($guruId, $mapelId)
    {
        $soal = $this->soalModel
            ->where('guru_id', $guruId)
            ->where('mapel_id', $mapelId)
            ->orderBy('jenis', 'ASC')
            ->findAll();

        $guru = $this->guruModel->find($guruId);
        $mapel = $this->db->table('mapel')->where('id', $mapelId)->get()->getRowArray();
---
SELECT *
FROM `soal`
WHERE `guru_id` = '1'
AND `mapel_id` = '1'
ORDER BY `jenis` ASC
SELECT *
FROM `guru`
WHERE `guru`.`id` = '1'
SELECT *
FROM `mapel`
WHERE `id` = '1'