app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `sekolah`
SELECT COUNT(*) AS `numrows` FROM `guru`
SELECT COUNT(*) AS `numrows` FROM `siswa`
SELECT COUNT(*) AS `numrows` FROM `mapel`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data = [
            'title' => 'Dashboard Admin',
            'total_sekolah' => $db->table('sekolah')->countAll(),
            'total_pembuat_soal' => $db->table('guru')->countAll(),
            'total_siswa' => $db->table('siswa')->countAll(),
            'total_mapel' => $db->table('mapel')->countAll(),