app/Controllers/Admin/HasilUjian.php

    public function index()
    {
        $sekolahId = $this->request->getGet('sekolah_id');
        $mapelId = $this->request->getGet('mapel_id');

        $siswaData = [];
        $jadwalInfo = null;

        if ($sekolahId && $mapelId) {
            $jadwal = $this->db->table('jadwal_ujian')
                ->where('sekolah_id', $sekolahId)
                ->where('mapel_id', $mapelId)
                ->orderBy('id', 'DESC')
                ->get()->getRowArray();

            if ($jadwal) {
                $jadwalInfo = $jadwal;

                $allSiswa = $this->db->table('siswa')
                    ->where('sekolah_id', $sekolahId)
                    ->orderBy('nama_lengkap', 'ASC')
                    ->get()->getResultArray();

                foreach ($allSiswa as $s) {
                    $status = $this->db->table('status_ujian_siswa')
                        ->where('jadwal_id', $jadwal['id'])
                        ->where('siswa_id', $s['id'])
                        ->get()->getRowArray();
---
SELECT *
FROM `jadwal_ujian`
WHERE `sekolah_id` = '2'
AND `mapel_id` = '1'
ORDER BY `id` DESC
SELECT *
FROM `siswa`
WHERE `sekolah_id` = '2'
ORDER BY `nama_lengkap` ASC
SELECT *
FROM `status_ujian_siswa`
WHERE `jadwal_id` = '1'
AND `siswa_id` = '1'

            }
        }

        $sekolah = $this->db->table('sekolah')->get()->getResultArray();
        $mapel = $this->db->table('mapel')->get()->getResultArray();
---
SELECT *
FROM `sekolah`
SELECT *
FROM `mapel`