app/Controllers/Admin/Instansi.php

    public function index()
    {
        $instansi = $this->db->table('profil_instansi')->where('id', 1)->get()->getRowArray();
---
SELECT *
FROM `profil_instansi`
WHERE `id` = 1