app/Controllers/Admin/JadwalUjian.php

    public function index()
    {
        $jadwal = $this->jadwalModel->select('jadwal_ujian.*, sekolah.nama_sekolah, mapel.nama_mapel')
            ->join('sekolah', 'sekolah.id = jadwal_ujian.sekolah_id')
            ->join('mapel', 'mapel.id = jadwal_ujian.mapel_id')
            ->orderBy('tanggal_ujian', 'DESC')
            ->findAll();
---
SELECT `jadwal_ujian`.*, `sekolah`.`nama_sekolah`, `mapel`.`nama_mapel`
FROM `jadwal_ujian`
JOIN `sekolah` ON `sekolah`.`id` = `jadwal_ujian`.`sekolah_id`
JOIN `mapel` ON `mapel`.`id` = `jadwal_ujian`.`mapel_id`
ORDER BY `tanggal_ujian` DESC

    public function getMapelBySekolah($sekolahId)
    {
        $mapel = $this->db->table('sekolah_mapel')
            ->select('mapel.id, mapel.nama_mapel')
            ->join('mapel', 'mapel.id = sekolah_mapel.mapel_id')
            ->where('sekolah_mapel.sekolah_id', $sekolahId)
            ->get()->getResultArray();
---
SELECT `mapel`.`id`, `mapel`.`nama_mapel`
FROM `sekolah_mapel`
JOIN `mapel` ON `mapel`.`id` = `sekolah_mapel`.`mapel_id`
WHERE `sekolah_mapel`.`sekolah_id` = '2'

    public function store()
    {
        if (!$this->validate([
            'sekolah_id' => 'required',
            'mapel_id' => 'required',
            'tanggal_ujian' => 'required',
            'jam_mulai' => 'required',
            'lama_ujian' => 'required|numeric'
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $guru = $this->db->table('guru')
            ->join('guru_mapel', 'guru_mapel.guru_id = guru.id')
            ->where('guru.sekolah_id', $this->request->getPost('sekolah_id'))
            ->where('guru_mapel.mapel_id', $this->request->getPost('mapel_id'))
            ->get()->getRow();
---
SELECT *
FROM `guru`
JOIN `guru_mapel` ON `guru_mapel`.`guru_id` = `guru`.`id`
WHERE `guru`.`sekolah_id` = '2'
AND `guru_mapel`.`mapel_id` = '1'