app/Controllers/Admin/Mapel.php

    public function index()
    {
        $data = [
            'title' => 'Data Mata Pelajaran',
            'mapel' => $this->mapelModel->findAll()
---
SELECT *
FROM `mapel`