app/Controllers/Admin/PembuatSoal.php

    public function index()
    {
        // Tidak perlu join ke sekolah lagi
        $users = $this->guruModel->findAll();
---
SELECT *
FROM `guru`