app/Controllers/Admin/PengaturanSekolah.php

SELECT *
FROM `sekolah`
---
    public function index()
    {
        $data = [
            'title' => 'Pengaturan Mapel Sekolah',
            // Mengambil data dari tabel sekolah (daftar unit/wilayah)
            'instansi' => $this->db->table('sekolah')->get()->getResultArray()

SELECT *
FROM `sekolah`
WHERE `id` = '2'
SELECT *
FROM `mapel`
SELECT *
FROM `sekolah_mapel`
WHERE `sekolah_id` = '2'
---
    public function manage($id)
    {
        $sekolah = $this->db->table('sekolah')->where('id', $id)->get()->getRowArray();

        if (!$sekolah) {
            return redirect()->to('admin/pengaturan_sekolah')->with('error', 'Data sekolah tidak ditemukan.');
        }

        $allMapel = $this->db->table('mapel')->get()->getResultArray();

        $currentMapel = $this->db->table('sekolah_mapel')->where('sekolah_id', $id)->get()->getResultArray();

DELETE FROM `sekolah_mapel`
WHERE `sekolah_id` = '2'
INSERT INTO `sekolah_mapel` (`mapel_id`, `sekolah_id`)
VALUES ('1','2'), ('2','2')
---
    public function save()
    {
        $sekolahId = $this->request->getPost('sekolah_id');
        $mapelIds = $this->request->getPost('mapel_id');

        // Hapus mapping lama
        $this->db->table('sekolah_mapel')->where('sekolah_id', $sekolahId)->delete();

        // Insert mapping baru
        if ($mapelIds && is_array($mapelIds)) {
            $dataInsert = [];
            foreach ($mapelIds as $mapelId) {
                $dataInsert[] = [
                    'sekolah_id' => $sekolahId,
                    'mapel_id' => $mapelId
                ];
            }
            $this->db->table('sekolah_mapel')->insertBatch($dataInsert);