app/Controllers/Admin/Sekolah.php

    public function index()
    {
        $data = [
            'title' => 'Data Sekolah',
            'sekolah' => $this->db->table('sekolah')->orderBy('nama_sekolah', 'ASC')->get()->getResultArray()
---
SELECT *
FROM `sekolah`
ORDER BY `nama_sekolah` ASC