app/Controllers/Admin/Siswa.php

SELECT `siswa`.*, `sekolah`.`nama_sekolah`
FROM `siswa`
JOIN `sekolah` ON `sekolah`.`id` = `siswa`.`sekolah_id`
SELECT `siswa`.*, `sekolah`.`nama_sekolah`
FROM `siswa`
LEFT JOIN `sekolah` ON `sekolah`.`id` = `siswa`.`sekolah_id`
ORDER BY `siswa`.`id` DESC
SELECT *
FROM `sekolah`
---
    public function index()
    {
        $sekolahId = $this->request->getGet('sekolah_id');

        $builder = $this->siswaModel->select('siswa.*, sekolah.nama_sekolah')
            ->join('sekolah', 'sekolah.id = siswa.sekolah_id');

        if ($sekolahId) {
            $builder->where('siswa.sekolah_id', $sekolahId);
        }

        $data = [
            'title' => 'Data Siswa',
            'siswa' => $builder->orderBy('siswa.id', 'DESC')->findAll(),
            'sekolah' => $this->sekolahModel->findAll(),

SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '2'
---
    public function edit($id)
    {
        $siswa = $this->siswaModel->find($id);
        if (!$siswa) {
            return redirect()->to('admin/siswa')->with('error', 'Data tidak ditemukan.');
        }

        $data = [
            'title' => 'Edit Siswa',
            'siswa' => $siswa,
            'sekolah' => $this->sekolahModel->findAll(),
            'validation' => \Config\Services::validation()
        ];

SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '1'
DELETE FROM `siswa`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        $siswa = $this->siswaModel->find($id);
        if ($siswa) {
            if ($siswa['foto'] != 'default.jpg' && file_exists('uploads/profil/' . $siswa['foto'])) {
                unlink('uploads/profil/' . $siswa['foto']);
            }
            $this->siswaModel->delete($id);