app/Controllers/Admin/Siswa.php

SELECT *
FROM `sekolah`
ORDER BY `nama_sekolah` ASC
---
    public function index()
    {
        $sekolahId = $this->request->getGet('sekolah_id');

        // Join tabel sekolah untuk menampilkan nama sekolah di tabel
        $builder = $this->siswaModel->select('siswa.*, sekolah.nama_sekolah')
            ->join('sekolah', 'sekolah.id = siswa.sekolah_id', 'left');

        if ($sekolahId) {
            $builder->where('siswa.sekolah_id', $sekolahId);
        }

        $data = [
            'title' => 'Data Siswa',
            'siswa' => $builder->orderBy('siswa.id', 'DESC')->findAll(),
            'sekolah' => $this->sekolahModel->orderBy('nama_sekolah', 'ASC')->findAll(),

SELECT *
FROM `sekolah`
ORDER BY `nama_sekolah` ASC
---
    public function edit($id)
    {
        $siswa = $this->siswaModel->find($id);
        if (!$siswa) {
            return redirect()->to('admin/siswa')->with('error', 'Data tidak ditemukan.');
        }

        $data = [
            'title' => 'Edit Siswa',
            'siswa' => $siswa,
            'sekolah' => $this->sekolahModel->orderBy('nama_sekolah', 'ASC')->findAll(),