app/Controllers/Admin/Updater.php

SELECT *
FROM `app_version`
ORDER BY `id` DESC
---
    public function index()
    {
        if (file_exists($this->statusFile)) @unlink($this->statusFile);

        $currentVersion = '1.0.0';
        $checkTabel = $this->db->table('information_schema.tables')->where('table_name', 'app_version')->countAllResults();

        if ($checkTabel > 0) {
            $query = $this->db->table('app_version')->orderBy('id', 'DESC')->get()->getRow();