app/Controllers/Guru/BankSoal.php

SELECT *
FROM `mapel`
WHERE `id` = '1'
---
    public function jenis($sekolahId, $mapelId)
    {
        $guruId = session()->get('id');
        $sekolah = $this->db->table('sekolah')->where('id', $sekolahId)->get()->getRowArray();
        $mapel = $this->db->table('mapel')->where('id', $mapelId)->get()->getRowArray();