app/Controllers/Guru/Ujian.php

    public function index()
    {
        $guruId = session()->get('id');

        $jadwal = $this->jadwalModel->select('jadwal_ujian.*, kelas.nama_kelas, mapel.nama_mapel')
            ->join('kelas', 'kelas.id = jadwal_ujian.kelas_id')
            ->join('mapel', 'mapel.id = jadwal_ujian.mapel_id')
            ->where('jadwal_ujian.guru_id', $guruId)
            ->orderBy('tanggal_ujian', 'DESC')
            ->findAll();
---
SELECT `jadwal_ujian`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`
FROM `jadwal_ujian`
JOIN `kelas` ON `kelas`.`id` = `jadwal_ujian`.`kelas_id`
JOIN `mapel` ON `mapel`.`id` = `jadwal_ujian`.`mapel_id`
WHERE `jadwal_ujian`.`guru_id` = '2'
ORDER BY `tanggal_ujian` DESC

    public function create()
    {
        $guruId = session()->get('id');

        $kelas = $this->db->table('guru_kelas')
            ->select('kelas.*')
            ->join('kelas', 'kelas.id = guru_kelas.kelas_id')
            ->where('guru_kelas.guru_id', $guruId)
            ->groupBy('kelas.id')
            ->get()->getResultArray();
---
SELECT `kelas`.*
FROM `guru_kelas`
JOIN `kelas` ON `kelas`.`id` = `guru_kelas`.`kelas_id`
WHERE `guru_kelas`.`guru_id` = '2'
GROUP BY `kelas`.`id`

    public function getMapelByKelas($kelasId)
    {
        $guruId = session()->get('id');

        $mapel = $this->db->table('mapel')
            ->select('mapel.*')
            ->join('kelas_mapel', 'kelas_mapel.mapel_id = mapel.id')
            ->join('guru_mapel', 'guru_mapel.mapel_id = mapel.id')
            ->where('kelas_mapel.kelas_id', $kelasId)
            ->where('guru_mapel.guru_id', $guruId)
            ->groupBy('mapel.id')
            ->get()->getResultArray();
---
SELECT `mapel`.*
FROM `mapel`
JOIN `kelas_mapel` ON `kelas_mapel`.`mapel_id` = `mapel`.`id`
JOIN `guru_mapel` ON `guru_mapel`.`mapel_id` = `mapel`.`id`
WHERE `kelas_mapel`.`kelas_id` = '2'
AND `guru_mapel`.`guru_id` = '2'
GROUP BY `mapel`.`id`