app/Controllers/Auth.php

SELECT *
FROM `admin`
WHERE `username` = 'guru'
 LIMIT 1
SELECT *
FROM `guru`
WHERE `username` = 'guru'
 LIMIT 1
---
    public function prosesLogin()
    {
        // ... (Kode lama untuk Admin/Guru tetap sama) ...
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $adminModel = new AdminModel();
        $guruModel = new GuruModel();

        // Cek Admin
        $user = $adminModel->where('username', $username)->first();
        $role = 'admin';

        // Cek Guru
        if (!$user) {
            $user = $guruModel->where('username', $username)->first();