app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        $this->session = \Config\Services::session();
        $db = \Config\Database::connect();

        // 1. GLOBAL DATA SEKOLAH (Untuk Favicon & Judul)
        // Ambil data sekolah (asumsi ID 1 adalah data utama)
        $sekolah = $db->table('sekolah')->where('id', 1)->get()->getRowArray();

        // Share data sekolah ke semua view
        // Jika belum ada data, set array kosong agar tidak error
        $dataGlobal = [
            'sekolah_data' => $sekolah ?? []
        ];

        // 2. GLOBAL DATA USER (Sidebar & Auth)
        if ($this->session->has('is_login')) {
            $role = $this->session->get('role');
            $id = $this->session->get('id');

            $query = null;

            if ($role == 'admin') {
                $query = $db->table('admin')->where('id', $id)->get()->getRowArray();
            } elseif ($role == 'guru') {
                $query = $db->table('guru')->where('id', $id)->get()->getRowArray();
            } elseif ($role == 'siswa') {
                $query = $db->table('siswa')->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `sekolah`
WHERE `id` = 1
SELECT *
FROM `admin`
WHERE `id` = '1'
SELECT *
FROM `guru`
WHERE `id` = '2'
SELECT *
FROM `siswa`
WHERE `id` = '3'